In [1]:
import pandas as pd
import faker
import random
from sqlalchemy import create_engine, text
from sqlalchemy.orm import sessionmaker
from IPython.display import display, Markdown

fake = faker.Faker()

In [2]:
mysql_root = create_engine("mysql+pymysql://root:utdt@utdt-concurrencia-mysql-1:3306/utdt")
with mysql_root.begin() as conn:
    conn.execute(text("GRANT SUPER ON *.* TO utdt"))

mysql = create_engine("mysql+pymysql://utdt:utdt@utdt-concurrencia-mysql-1:3306/utdt")
pg = create_engine("postgresql+psycopg2://utdt:utdt@utdt-concurrencia-postgres-1/utdt")

mysql_session = sessionmaker(mysql, autoflush=False, expire_on_commit=False)
pg_session = sessionmaker(pg)

In [3]:
initial_data = pd.DataFrame({
    "name": [fake.company()],
    "balance": [1000.0]
})

initial_data.to_sql("account", mysql, if_exists="replace", index=True, index_label="id")

1

## Read Uncommitted && Dirty reads

En este escenario, el más débil de los niveles de aislacion, todas las lecturas se ejecutan sin un lock. Por lo que una transacción puede leer data no committeada de otra transacción. Esto se llama **dirty read**.

In [4]:
with mysql_session() as s1, mysql_session() as s2:
    
    s1.execute(text("set session transaction isolation level read uncommitted"))
    s2.execute(text("set global transaction isolation level read uncommitted"))

    display(f"for session 1, the isolation level is {s1.execute(text('SELECT @@transaction_ISOLATION')).fetchone()}")
    display(f"for session 2, the isolation level is {s2.execute(text('SELECT @@transaction_ISOLATION')).fetchone()}")

    s1.get_transaction().close()
    s2.get_transaction().close()

    with s1.begin() as trx1, s2.begin() as trx2:
        display(Markdown("Session 1: `select * from account`"))
        display(pd.read_sql("select * from account", s1.bind))
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))
        
        display(Markdown("Session 1: Updating without committing"))
        s1.execute(text("update account set balance = balance + 100 where id = 0"))
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))
        
        display(Markdown("Session 1: Rollback"))
        trx1.rollback()
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))

"for session 1, the isolation level is ('READ-UNCOMMITTED',)"

"for session 2, the isolation level is ('READ-COMMITTED',)"

Session 1: `select * from account`

   id        name  balance
0   0  Hanson Inc   1000.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1000.0

Session 1: Updating without committing

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1000.0

Session 1: Rollback

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1000.0

Si a nivel aplicación se utilizó el valor de `1100` de la `trx2`, el valor es érroneo luego del rollback de `trx1`.

## Read committed && Non-repeatable reads

In [5]:
with mysql_session() as s1, mysql_session() as s2:
    
    s1.execute(text("set session transaction isolation level read committed"))
    s2.execute(text("set global transaction isolation level read committed"))

    display(f"for session 1, the isolation level is {s1.execute(text('SELECT @@transaction_ISOLATION')).fetchone()}")
    display(f"for session 2, the isolation level is {s2.execute(text('SELECT @@transaction_ISOLATION')).fetchone()}")

    s1.get_transaction().close()
    s2.get_transaction().close()

    with s1.begin() as trx1, s2.begin() as trx2:
        display(Markdown("Session 1: `select * from account`"))
        display(pd.read_sql("select * from account", s1.bind))
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))
        
        display(Markdown("Session 1: Updating without committing"))
        s1.execute(text("update account set balance = balance + 100 where id = 0"))

        display(Markdown("Session 1: `select * from account`"))
        display(pd.read_sql("select * from account", s1.bind))
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))
        
    display(Markdown("Nuevas transacciones..."))

    with s1.begin() as trx1, s2.begin() as trx2:
        display(Markdown("Session 1: `select * from account`"))
        display(pd.read_sql("select * from account", s1.bind))
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))
        
        display(Markdown("Session 1: Updating without committing"))
        s1.execute(text("update account set balance = balance + 100 where id = 0"))

        display(Markdown("Session 1: `select * from account`"))
        display(pd.read_sql("select * from account", s1.bind))
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))

        trx1.commit()
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))

"for session 1, the isolation level is ('READ-COMMITTED',)"

"for session 2, the isolation level is ('READ-COMMITTED',)"

Session 1: `select * from account`

   id        name  balance
0   0  Hanson Inc   1000.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1000.0

Session 1: Updating without committing

Session 1: `select * from account`

   id        name  balance
0   0  Hanson Inc   1000.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1000.0

Nuevas transacciones...

Session 1: `select * from account`

   id        name  balance
0   0  Hanson Inc   1100.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1100.0

Session 1: Updating without committing

Session 1: `select * from account`

   id        name  balance
0   0  Hanson Inc   1100.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1100.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1200.0

Dentro de la misma transacción (`trx2`) de una sesión (`session 2`), el valor de la misma query dió resultados diferentes: este escenario se llama `non-repeatable reads`.

## Repeatable Read

In [6]:
with mysql_session() as s1, mysql_session() as s2:
    display(f"for session 1, the isolation level is {s1.execute(text('SELECT @@transaction_ISOLATION')).fetchone()}")
    display(f"for session 2, the isolation level is {s2.execute(text('SELECT @@transaction_ISOLATION')).fetchone()}")

    s1.get_transaction().close()
    s2.get_transaction().close()

    with s1.begin() as trx1, s2.begin() as trx2:
        display(Markdown("Session 1: `select * from account`"))
        display(pd.read_sql("select * from account", s1.bind))
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))
        
        display(Markdown("Session 1: Updating without committing"))
        s1.execute(text("update account set balance = balance + 100 where id = 0"))

        display(Markdown("Session 1: `select * from account`"))
        display(pd.read_sql("select * from account", s1.bind))
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))
        
    display(Markdown("Nuevas transacciones..."))

    with s1.begin() as trx1, s2.begin() as trx2:
        display(Markdown("Session 1: `select * from account`"))
        display(pd.read_sql("select * from account", s1.bind))
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))
        
        display(Markdown("Session 1: Updating without committing"))
        s1.execute(text("update account set balance = balance + 100 where id = 0"))

        display(Markdown("Session 1: `select * from account`"))
        display(pd.read_sql("select * from account", s1.bind))
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))

        trx1.commit()
        
        display(Markdown("Session 2: `select * from account`"))
        display(pd.read_sql("select * from account", s2.bind))

"for session 1, the isolation level is ('READ-COMMITTED',)"

"for session 2, the isolation level is ('READ-COMMITTED',)"

Session 1: `select * from account`

   id        name  balance
0   0  Hanson Inc   1200.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1200.0

Session 1: Updating without committing

Session 1: `select * from account`

   id        name  balance
0   0  Hanson Inc   1200.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1200.0

Nuevas transacciones...

Session 1: `select * from account`

   id        name  balance
0   0  Hanson Inc   1300.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1300.0

Session 1: Updating without committing

Session 1: `select * from account`

   id        name  balance
0   0  Hanson Inc   1300.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1300.0

Session 2: `select * from account`

   id        name  balance
0   0  Hanson Inc   1400.0